app/controllers/articles_controller.rb

  def show
    @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 1) LIMIT 1

  def create
    @article = Article.new(params[:article])

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ('Random article', 'Random body', '2011-02-13 22:15:45.318485', '2011-02-13 22:15:45.318485') RETURNING "id"